app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "ta@gmail.com"], ["LIMIT", 1]]
---
    def current_user
        if session[:user_id]
            @current_user ||= User.find_by(email:session[:user_id])