app/controllers/associates_controller.rb

       def create
         # if current_user.associate?
         #   render 'associate/edit'
         # else current_user.manager?
         #   render 'associate/edit'
         #  end
           @new = Associate.new()
           @values=params[:associate]
           @new.cerner_id=params[:associate][:cerner_id]
           @new.type_of_request=params[:associate][:type_of_request]
           @new.leave_approval=params[:associate][:leave_approval]
           @new.start_date=params[:associate][:start_date]
           @new.end_date=params[:associate][:end_date]

             @new.save
---
INSERT INTO "associates" ("leave_approval", "type_of_request", "cerner_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["leave_approval", ""], ["type_of_request", "Work From Home"], ["cerner_id", ""], ["created_at", "2019-10-04 08:42:06.678111"], ["updated_at", "2019-10-04 08:42:06.678111"]]