app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "nnnn@gmail.com"], ["LIMIT", 1]]
---
      def create
        # Look up User in db by the email address submitted to the login form and
        # convert to lowercase to match email in db in case they had caps lock on:
        user = User.find_by(email: params[:login][:email].downcase)

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "ta@gmail.com"], ["LIMIT", 1]]
---
      def index
       User.find_by(email:session[:user_id])