app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
      def create
        @user = User.new(user_params)

        # store all emails in lowercase to avoid duplicates and case-sensitive login errors:
        @user.email.downcase!

        if @user.save