app/controllers/userinfos_controller.rb

    def create
        @userinfo = Userinfo.new(userinfo_params)
        binding.pry
        if @userinfo.save
---
INSERT INTO "userinfos" ("leave_approval", "created_at", "updated_at") VALUES (?, ?, ?)  [["leave_approval", ""], ["created_at", "2019-09-17 12:08:57.464541"], ["updated_at", "2019-09-17 12:08:57.464541"]]